Documents/ПроверкаДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПроверкаДоступа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДоступа</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвиженияДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДоступа</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьПосещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДвиженияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьПосещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДвиженияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РезультатыПроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>РезультатыПроверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрешен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПроверкаДоступа/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если ЭтоНовый() Тогда
        ЭтотОбъект.УстановитьВремя(РежимАвтоВремя.НеИспользовать);
        Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
    // Проверяем, что результат заполнен
    Если НЕ ЗначениеЗаполнено(Результат) Тогда
        Сообщить("Результат проверки должен быть установлен перед записью!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    СообщениеОбОшибке = "";

    // Проверка обязательных полей
    Если НЕ ЗначениеЗаполнено(Пропуск) Тогда
        Сообщить("Не указан пропуск!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ЗонаДоступа) Тогда
        Сообщить("Не указана зона доступа!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТочкаКонтроля) Тогда
        Сообщить("Не указана точка контроля!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверяем действительность пропуска
    Если НЕ ОбщиеПроверкиПропусков.ПропускДействителен(Пропуск, Дата, СообщениеОбОшибке) Тогда
        Результат = Перечисления.РезультатыПроверки.Запрещен; // Предполагаем перечисление
        Сообщить(СообщениеОбОшибке);
        // Не отказываемся, так как нужно записать результат "Запрещен"
    КонецЕсли;

    // Проверяем соответствие зоны доступа
    Если НЕ ОбщиеПроверкиПропусков.ЗонаДоступаСоответствуетПропуску(Пропуск, ЗонаДоступа, СообщениеОбОшибке) Тогда
        Результат = Перечисления.РезультатыПроверки.Запрещен;
        Сообщить(СообщениеОбОшибке);
        // Не отказываемся, так как нужно записать результат "Запрещен"
    КонецЕсли;

    // Если проверки прошли успешно, устанавливаем "Разрешен"
    Если ПустаяСтрока(СообщениеОбОшибке) Тогда
        Результат = Перечисления.РезультатыПроверки.Разрешен;
    КонецЕсли;

    // Формируем движения
    Если ТипЗнч(Пропуск) = Тип("ДокументСсылка.ВыдачаПропуска") Тогда
        Движения.ДвиженияДоступа.Записывать = Истина;

        Движение = Движения.ДвиженияДоступа.Добавить();
        Движение.Период = Дата;
        Движение.Посетитель = Посетитель;
        Движение.ЗонаДоступа = ЗонаДоступа;
        Движение.ТочкаКонтроля = ТочкаКонтроля;
		Движение.Результат = Результат; 
		
    ИначеЕсли ТипЗнч(Пропуск) = Тип("ДокументСсылка.ВыдачаПропускаНаТС") Тогда
        Движения.ДвиженияТС.Записывать = Истина;
		
        Движение = Движения.ДвиженияТС.Добавить();
        Движение.Период = Дата;
        Движение.Посетитель = Посетитель;  
		Движение.ТранспортноеСредство = ТранспортноеСредство;
        Движение.ЗонаДоступа = ЗонаДоступа;
        Движение.ТочкаКонтроля = ТочкаКонтроля;
		Движение.Результат = Результат; 
	КонецЕсли;    
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Если ТипЗнч(Пропуск) = Тип("ДокументСсылка.ВыдачаПропуска") Тогда
        Движения.ДвиженияДоступа.Записывать = Истина;
        Движения.ДвиженияДоступа.Очистить();
    ИначеЕсли ТипЗнч(Пропуск) = Тип("ДокументСсылка.ВыдачаПропускаНаТС") Тогда
        Движения.ДвиженияТС.Записывать = Истина;
        Движения.ДвиженияТС.Очистить();
    КонецЕсли;
КонецПроцедуры
